# -*- coding: utf-8 -*-

from math import log
import collections
from pprint import pprint

def analysis_content(docs):
    doc_info = {}
    for doc in docs:
        counts = collections.Counter(doc)
        
        for word, freq in zip(counts.keys(), counts.values()):
            doc_info[word] = freq
    return doc_info

def extract_word(docs):
    return  list(set(word for doc in docs for word in doc))

def tf(t, d):
    return d.count(t)

def idf(t, docs):
    df = 0
    for doc in docs:
        df += t in doc
    N = len(docs)
    return log(N/(df+1))

def tfidf(t, d, docs):
    return tf(t,d)* idf(t, docs)

def best_tags(docs):

    N = len(docs)
    word_frequency = analysis_content(docs)

    word_list = extract_word(docs)

    result = []
    for i in range(N):
        result.append([])
        d = docs[i]
        for j in range(len(word_list)):
            t = word_list[j]
            result[-1].append(tfidf(t,d, docs))

    best_tags = []
    
    for i in range(N):
        best_tags.append([])
        temp = {}
        for j in range(len(word_list)):
            if result[i][j]>0 and len(word_list[j])>1:
                temp[word_list[j]]=result[i][j]
        sorted_temp = sorted(temp.items(), key = lambda item: item[1], reverse = True)
        try: 
            for word in sorted_temp[:4]:
                temp = []
                temp.append(word[0])
                temp.append(word[1])
                best_tags[-1].append(temp)
        except : print("e")

    for tags in best_tags:
        for tag in tags:
            tag[1] = round(tag[1],2)
    pprint(best_tags)
    return best_tags

youtubes =[
    ['세븐', '틴', '킬링', '보이스', '라이브', '박수', '울', '딩고', '뮤직', '디', '아이', '오', '세븐', '틴', '콜라보레이션', '명', '완전체', '킬링', '보이스', '그냥', '선곡', '리스트', '오프닝', '만세'],
    ['잉', '특급', '당신', '심장', '콘텐츠', '잉', '특급', '당신', '심장', '콘텐츠', '재미', '초', '강력', '콘텐츠', '대결', '앞', '담화'],
    ['영국', '고등학교', '전교생', '한국', '치킨', '최근', '영국', '고등학생', '시리즈', '총', '조회', '수가', '억', '해', '이', '기쁨', '학생', '제대로', '한국', '음식', '보지'], ['어서', '드레스', '피팅', '처음', '어서', '드레스', '피팅', '처음', '아이유'], ['병문안', '스케치', '코미디', '숏', '박스', '병문안'], ['임창정', '부자', '엄마', '첫', '동반', '외출', '날', '동상', '이몽', '방송', '탕', '외출', '준비', '동상', '이몽', '임창정', '서하', '얀', '월요일', '오후'],
    ['아나운서', '산골', '농부가', '사나이', '이계진', '년차', '자연', '생활', '그', '것', '자연', '철학자', '금', '방송국', '여행', '자연', '철학자', '화', '이계진', '끽', '끽반', '회', '이계진', '끽', '끽반', '편', '년', '차', '산골', '농부', '삶'], ['에버랜드', '놀러와', '친구', '강제', '아마존', '알바', '윤쭈꾸', '리스', '좌윤', '쭈', '동현', '조합'], ['엔시', '티', '드림', '비트박스', '퍼포먼스', '스페셜', '클립', '엔시', '티', '드림', '비트박스', '퍼포먼스', '스페셜', '클립', '엔시', '티', '드림', '스페셜', '클립', '퍼포먼스'], ['조유리', '러브', '쉿'], ['엔시', '티', '드림', '버퍼링'], ['도르트문트', '소속', '선발', '출전', '한국인', '유망', '주', '태클', '월드', '클래스', '자칭', '코리안', '홀란드', '돌문', '유', '스팀', '소름', '장면', '슛포', '러브', '더', '보기'], ['아이유', '팔레트', '세븐', '틴', '유', '촌', '유', '세븐', '틴', '아이유', '팔레트', '세븐', '틴', '유', '촌', '유', '세븐', '틴', '아이유', '세븐', '틴', '팔레트'], ['에스', '파', '도깨비불'], ['운수', '날', '맥거핀', '일상', '애니메이션', '실화', '바탕', '제작', '맥거핀', '스튜디오', '맥거핀', '쿠룡', '연두', '은', '유난', '려무', '무', '팬아트'], ['분', '순삭', '꼬질', '구씨', '수트', '영어', '손', '구씨', '슈츠', '속', '손', '데이빗', '킴', '컷', '모음', '필모케기', '방송', '필모케기', '손', '구', '슈츠', '또', '또', '못', '참고', '필', '케버린', '케', '백수', '편집자', '손', '구', '영어', '발음', '데', '손', '구', '수트', '핏', '데', '손', '구'], ['엔시', '티', '드림'], ['신속', '복습', '사상', '최초', '엄마', '임창정', '부자', '놀이', '공원', '데이', '준비', '동상', '이몽', '임창정', '서하', '얀', '신속', '복습', '스브스', '예능', '복습'], ['뭐', '윤', '노', '윤주', '골', '연결', '골키퍼', '패스', '단계', '아나콘다', '두', '에이스', '아나운서', '노', '윤주', '노', '윤주', '어시스트', '수', '킬패스', '골키퍼', '패스', '단계', '단계'], ['네이마르', '부상', '순간', '영상', '퉁퉁', '발등', '공개', '브라질', '축구', '대표팀', '슈퍼스타', '네이마르', '국전', '실시', '훈련', '오른발', '미니게임', '도중', '수비수', '치', '상대', '충돌'], ['이효리', '폭로', '정재형', '인성', '이장원', '오늘', '삽질', '삽', '이효리', '덕분', '삽', '최초', '인기', '동영상', '이번', '주도', '고량주', '잔', '더', '맛', '토크'], ['손목', '골프', '원리', '왼', '손목', '중요성', '선수', '최나연', '최나연', '골프'], ['풀', '영상', '방탄소년단', '등장', '백악관', '난리', '현장', '반응', '서울', '뉴스', '동주', '기자', '세계', '팝', '스타', '방탄소년단', '시간', '미국', '백악관', '브리핑', '룸', '아시아', '증오', '범죄', '대해', '입장'], ['깜짝', '공개', '은혜', '우블', '영희', '대사', '연습', '모습', '얼굴', '은혜', '지난', '겨울', '제주도', '까페', '우리', '블루스', '촬영', '영희', '대사', '연습', '모습', '깜짝', '공개'], ['직접', '설계', '컨', '하우스', '공개', '챠오', '우리', '친구', '오늘', '아미', '치', '할머니', '미래', '모습', '살짝', '공개', '해', '바로', '노후', '준비', '전원주택'], ['김태현', '미자', '결혼식', '공개', '신랑', '폭풍', '오열', '사연', '저희', '결혼식', '공개', '분', '언제', '신랑', '폭풍눈물', '아빠'], ['부', '한류', '전', '후', '미국', '유럽', '해외', '한국', '그', '한국', '진짜', '이유', '직접', '인터뷰', '외국인', '인터뷰', '반응', '한류', '그', '이후', '해외', '한국', '시선', '과언', '한국', '외국인', '반응', '한국', '이미지', '해외', '현지', '반응', '지금'], ['미국', '슬', '리핑', '기차', '시간', '미국', '미국', '서부', '여행', '브이', '로그', '미국', '국내', '여행', '암트랙', '이', '집', '밥', '원지', '하루'], ['다큐', '인사이트', '밖', '알래스카', '폭발', '음', '세기', '이후', '가장', '폭발', '통가', '섬', '무슨', '지상', '최대', '폭발', '방송', '다큐', '인사이트', '목요일', '밤', '시', '지상', '최대', '폭발', '세기', '이후', '가장', '폭발', '통가', '무슨', '년', '월', '일', '통가', '왕국'], ['썸남', '노래', '서동현', '빅', '나티', '서동현', '리플', '리플', '후원', '방법', '리플', '꿀잼', '영상', '계속'], ['한산', '용의', '출현', '티저', '예고편', '나라', '운명', '압', '도', '적', '승리', '한산', '용의', '출현', '티저', '예고편', '공개', '웅장', '가슴', '한산', '한산', '용의', '출현', '월말', '개봉', '박해일'], ['마지막', '인 사', '마지막', '인사'], ['여자', '결말', '포함', '영화', '배우', '지원', '개인', '프로필', '연기', '영상', '첨부', '아래', '메일', '지원', '배우', '지원', '광고', '문의'], ['징', '버거', '세구', '다', '준비', '부탁'], ['몸싸움', '허그', '드리블', '슈팅', '부상', '또', '혼자', '서도', '런닝맨', '일요일', '오후', '런닝맨', '유재석', '지석진', '하하', '양세찬', '송지효', '전소민', '김종국'], ['이', '긴장', '투호', '퇴근길', '반전', '월', '친선', '투호', '인캠', '리그', '정답', '공개', ' 브라질', '전', '투호', '오늘', '훈련', '불', '커뮤니티', '통해', '인캠', '리그', '오늘', '훈련'], ['이', '얼마', '파워에이드', '오픈', '트레이닝', '데이', '월', ' 친선', '대한민국', '축구', '국가대표팀', '친선경기', '시간', '선수', '팬', '이', '시간', '만', '팬', '훈련', '선수'], ['술', '깜짝', '카메라', '여친', '앞', '술', '얼마', '얼마', '발견', '엔조이', '커플', '라라', '위', '술', '수', '민뚜', '깜짝', '카메라'], ['할아버지', '손', '곁', '진돗개', '왕자', '올리버', '쌤', '맴버쉽', '클래스', '가입', '올리버', '쌤', '도서', '학습', '올리버', '쌤', '영어', '회화', '일력'], ['여우', '레이디', '생일', '우리', '좍', '쭈하쭈하', '해쭈', '더', '아 래', '링크', '통', '쭈', '유튜브', '라이브', '스트리밍', '재방', '계정'], ['봉지', '여름', '장모님', '표', '열무', '국수', '면', '계절', '여름', '열무', '국수'], ['카푸', '남자', '영상', '툰', '오늘', '시청', '모두', '감사', '영상', '모든', '저작권', '아리', '이야기', '무단', '불펌', '재', '업로드', '재', '가공', '금합'], ['비', '자식', '말', '안', '건', '애', '년', '킥', '서비스', '자율', '주행', '스케치', '코미디', '년', '시리즈', '자율', '주행', '편입', '니', '구독', '알림', '설정', '음악'], ['냥', '정리', '고양이', '를', '나름', '생각', '가족', '성격', '파악'], ['애플', '젠', '직접', '자가', '수리', '키트', '고장', '아이폰', '프로', '직접', '수리', '악명', '애플', '를', '개선', '프로그램', '작년', '시작', '고', '이야기', '애플', '자가', '수리', '서비스', '미국', '공식', '시작'], ['먹방', '브이', '로 그', '만이', '거', '운동', '요즘', '근황', '뿌', '링클', '탕', '카레', '치즈', '돈까스', '새우', '튀김', '우유', '크림', '빵', '포켓몬빵', '치킨', '햄버거', '미니', '도넛', '진행', '점', '양해', '토요일', '시', '업로드', '오늘'], ['첫', '만남', '증손', '주', '막례쓰', '증조', '할머니', '막례쓰', '증손', '주', '처음', '날', '막례', '할머니', '일상', '구독'], ['신경과학자', '세계', '최고', '착시', '직접', '이해', '소름', '우리', '눈', '착시', '왜', '발생', '숨숨', '앞치마', '곳', '오프 닝', '영상', '제작자', '및', '출처'], ['사슬', '레볼루션', '하트', '잭', '잭', '미니', '미니', '류', '류', '오뉴', '오뉴'], ['브라질', '처제', '한국', '여행', '시 작', '인천', '월미도', '편', '업로드', '저희', '채널', '문제', '수익', '창', '정말', '일', '일어나서', '걸', '해결', '정말'], ['손흥민', '선수', '한국', '꽃', '등 심', '토트넘', '선수', '반응', '쿠팡', '플레이', '시리즈', '대한', '내용', '이', '링크', '영상', '풀', '버전', '쿠팡', '플레이'], ['세븐', '틴', '세븐', '틴'], [' 잉', '특급', '당신', '심장', '콘텐츠', '잉', '특급', '당신', '심장', '콘텐츠', '재미', '초', '강력', '콘텐츠', '대결', '앞', '담화'], ['여자', '결말', '포함', '영 화', '배우', '지원', '개인', '프로필', '연기', '영상', '첨부', '아래', '메일', '지원', '배우', '지원', '광고', '문의'], ['임창정', '부자', '엄마', '첫', '동반', ' 외출', '날', '동상', '이몽', '방송', '탕', '외출', '준비', '동상', '이몽', '임창정', '서하', '얀', '월요일', '오후'], ['도르트문트', '소속', '선발', '출전', '한국 인', '유망', '주', '태클', '월드', '클래스', '자칭', '코리안', '홀란드', '돌문', '유', '스팀', '소름', '장면', '슛포', '러브', '더', '보기'], ['어서', '드레스', ' 피팅', '처음', '어서', '드레스', '피팅', '처음', '아이유'], ['윤하', '스물', '다섯', '스물', '하나', '불후', '명곡', '전설', '노래', '방송', '윤하', '스물', '다섯', '스물', '하나', '윤하', '스물', '다섯', '스물', '하나', '리메이크', '음악', '예능', '노래', '대결', '전설', '세대', '공감', '가요', '추억', '명곡', '불후의명곡', '전설', '노래'], ['신속', '복습', '사상', '최초', '엄마', '임창정', '부자', '놀이', '공원', '데이', '준비', '동상', '이몽', '임창정', '서하', '얀', '신속', '복습', '스브스', '예능', '복습'], ['병문안', '스케치', '코미디', '숏', '박스', '병문안'], ['임영웅', '무지개', '임영웅', '무지개', '임영웅', '웅', '튜브', '구독', '알람', '설정', '당신'], ['영국', '고등학교', '전교생', '한국', '치킨', '최근', '영국', '고등학생', '시리즈', '총', '조회', '수가', '억', '해', '이', '기쁨', '학생', ' 제대로', '한국', '음식', '보지'], ['아나운서', '산골', '농부가', '사나이', '이계진', '년차', '자연', '생활', '그', '것', '자연', '철학자', '금', '방송국', '여행', '자연', '철학자', '화', '이계진', '끽', '끽반', '회', '이계진', '끽', '끽반', '편', '년', '차', '산골', '농부', '삶'], ['분', '순삭', '꼬질', '구씨', '수트', '영어', '손', '구씨', '슈츠', '속', '손', '데이빗', '킴', '컷', '모음', '필모케기', '방송', '필모케기', '손', '구', '슈츠', '또', '또', '못', '참고', '필', '케버린', ' 케', '백수', '편집자', '손', '구', '영어', '발음', '데', '손', '구', '수트', '핏', '데', '손', '구'], ['엔시', '티', '드림'], ['에버랜드', '놀러와', '친구', '강제', '아마존', '알바', '윤쭈꾸', '리스', '좌윤', '쭈', '동현', '조합'], ['신경과학자', '세계', '최고', '착시', '직접', '이해', '소름', '우리', '눈', '착시', '왜', '발생', '숨숨', '앞치마', '곳', '오프닝', '영상', '제작자', '및', '출처'], ['젭', '소드', '걸음걸이', '욕', '진짜', '조폭', '손', '구', '아치', '나', '해방일', '방송', '젭', '소드', '연기력', '모음', '걸음걸이', '욕', '진짜', '조폭', '손', '구', '아치', '연기', '드라마', '나', '해방일', '손', '구'], ['사이다', '전학생', '학', '폭하', '려', '사촌언니', '개', '일진', '교육', '루', '대숲', '사연', '비즈니스', '문의', '여기', '루', '대숲', '출연', '신청', '메일', '연기', '영상', '연락처', ' 경력', '꼭', '첨부'], ['징', '버거', '세구', '다', '준비', '부탁'], ['사랑', '가족', '위풍', '은혜', '씨', '인생', '방송', '캐리커처', '작가', '정은혜', '씨', '어 디', '서든', '그녀', '일상', '나본', '정은혜', '우리', '블루스', '한지민', '캐리커쳐', '작가', '배우', '사랑', '가족'], ['연애', '웹', '드라마', '오픈', '타운', ' 이', '영상', '오픈', '타운', '제작비', '지원', '제작', '문의', '메일'], ['우리', '잠', '못', '올해', '득점', '손흥민', '선수', '프리미어리그', '시즌', '스포일러', '어워즈', '유튜브', '건', '번', '스포일러', '어워즈', '편', '올해', '득점', '시청', '구독'], ['뭐', '소름', '충격', '연속', '상상', '못', '그녀', '정체', '워', '너비', '최종', '인', '얼굴', '공개', '방송', '뭐', '본방', '워', '너비'], ['환상', '섬', '칼로리', '먹방', '기행', '괌', '괌', '여행', '박', '일로', '보틀', '앞', ' 또', '여행', '준비', '습'], [], ['한혜진', '술터뷰', '기안'], ['신속', '복습', '김준호', '여자친구', '김지민', '소개', '소주', '병', '공개', '연애', '후', '첫', ' 동반', '출연', '신발', '돌싱', '포맨', '스브스', '예능', '신속', '복습', '김준호', '김지민', '신속', '복습'], ['에스', '파', '도깨비불'], ['브로커', '첫', '상영', '대거', '아이유', '팬덤', '전세계', '취재', '진', '칸', '뉴스', '영광', '기자', '가수', '겸', '배우', '이지은', '아이유', '영화', '브로커', '통해', '칸', '영화제', '레드카펫', '가운데', '현장', '이지은', '팬', '대거'], ['브라질', '처제', '한국', '여행', '시작', '인천', '월미도', '편', '업로드', '저희', '채널', '문제', '수익', '창', '정말', '일', '일어나서', '걸', '해결', '정말'], ['최초', '동반', '출연', '돌싱', '포맨', '등장', '준호', '여자친구', '신발', '돌싱', '포맨', '방송', '주식', '사랑', '신발', '돌싱', '포맨', '김준호', '김지민', '탁재훈', '이상민', '임원희', '화요일', '오후'], ['첫째', '톡방', '막내', '찾기', '세븐', '틴', '호시', '첫 째', '톡방', '막내', '호시', '호시', '눈물'], ['썸남', '노래', '서동현', '빅', '나티', '서동현', '리플', '리플', '후원', '방법', '리플', '꿀잼', '영상', '계속'], ['여우', '레이디', '생일', '우리', '좍', '쭈하쭈하', '해쭈', '더', '아래', '링크', '통', '쭈', '유튜브', '라이브', '스트리밍', '재방', '계정'], ['병문안', '스케치', '코미디', '숏', '박스', '병원'], ['두', '스튜어디스', '휴양지', '가면', '일', '괌', '이번', '영상', '에어부산', '왕복', '항공권', '제공', '만', '해외여행', '보틀', '괌', '에어부산'], ['카푸', '남자', '영상', '툰', '오늘', '시청', '모두', '감사', '영상', '모든', '저작권', '아리', '이야기', '무단', '불펌', '재', '업로드', '재', '가공', '금합'], ['직접', '설계', '컨', '하우스', '공개', '챠오', '우리', '친구', '오늘', '아미', '치', '할머니', '미래', '모습', '살짝', '공개', '해', '바로', '노후', '준비', '전원주택'], ['부', '한류', '전', '후', '미국', '유럽', '해외', '한국', '그', '한국', '진짜', '이유', '직접', '인터뷰', '외국인', '인터뷰', '반응', '한류', '그', '이후', '해외', '한국', '시선', '과언', '한국', '외국인', '반응', '한국', '이미지', '해외', '현지', '반응', '지금'], ['김태현', '미자', '결혼식', ' 공개', '신랑', '폭풍', '오열', '사연', '저희', '결혼식', '공개', '분', '언제', '신랑', '폭풍눈물', '아빠'], ['진딧물', '응애', '깍지', '벌레', '것', '퇴치', '천연', '살충제', '진딧물', '과일', '나무', '채소', '즙', '해충', '피해', '번식', '한번', '발생', '작물', '곳', '곳', '작물'], ['참외', '무조건', '년', '맛', '김', '대석', '셰프', '년', '노하우', '공개', '오늘', '참외', '장아찌', '레시피', '컵'], ['텃밭', '집안', '여왕개미', '싹', '제거', '방법', '진딧물', '바퀴벌레', '깍지', '벌 레', '인기', '급상승', '동영상', '고추', '밭', '화분', '개미', '바퀴벌레', '진딧물', '깍지', '벌레', '방', '퇴치', '방법', '구독', '무료', '도움', '구독'], ['최근', '유럽', '한식', '뷔페', '장난', '한식당', '리뷰', '생각', '그냥', '밥', '한식', '뷔페', '니요', '보통', '해외', '한식당', '자주', '접', '수', '한식', '뷔페'], ['상대', '시즌', '드가자'], ['쌍발', '엔진', '동음', '시험', '비행', '조종사', '인터뷰', '특집', '지상', '시험', '프로', '파일럿', '단독', '공개', '현장', '상황', ' 음질', '못', '점', '양해', '곧', '최초', '비행', '김보현']]

best_tags(youtubes)